lib/tasks/cron.rake

	  task deliver_emails: :environment do

	    # ... whatever logic you need

	    @all_appointments = Appointment.all
	    @all_patient_email = []
	    @all_appointments.each do |ap|



	      d = ap.date.to_s.split("-")
	      t = ap.time.strftime("%H:%M:%S %z").to_s.split(":")

	      appointment_date = DateTime.new(d[0].to_i, d[1].to_i, d[2].to_i, t[0].to_i, t[1].to_i, t[2].to_i, t[3].to_i).change(:offset => "+0530")

	      current_date = DateTime.now()
	      difference_in_time = ((appointment_date.to_time - current_date.to_time) /3600)  * 60

	      puts difference_in_time
	      # for testing purpose the number of minutes is taken as <=30 that means mail will be sent every minutes in 30.
	      #Actual code condition would be difference_in_time.to_i==30
	      if difference_in_time.to_i<=30

	            @patient_det =  Patient.where(id: ap.patient_id)

	            @patient_det.each do |pat|

	                @users = User.where(id: pat.users_id)
---
SELECT `appointments`.* FROM `appointments`
SELECT `patients`.* FROM `patients` WHERE `patients`.`id` = 5
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12