app/views/doctors/index.html.erb

SELECT `doctors`.* FROM `doctors`
---
<% if current_user.role==='doctor' %>
<span class="doctor-show-header"><h3>Hello, <%= current_user.first_name %> <%= current_user.last_name %></h3></span>

SELECT `doctors`.* FROM `doctors`
---
<% else %>
<span class="doctor-show-header"><h3>Hello, <%= current_user.first_name %> <%= current_user.last_name %></h3></span>

SELECT COUNT(*) FROM `appointments` WHERE `appointments`.`doctor_id` = 6
---
        <td><%= doctor.phone %></td>
        <td><%= doctor.appointments.count %></td>