app/controllers/appointments_controller.rb

  def index
    @appointments = @doctor.appointments.order(:date, :time)
    @patient_id = Patient.where(users_id: current_user.id)
---
SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`doctor_id` = 7 AND `appointments`.`doctor_id` IS NULL ORDER BY `appointments`.`date` ASC, `appointments`.`time` ASC
SELECT `patients`.* FROM `patients` WHERE `patients`.`users_id` = 9

  def show
    @patient = @appointment.patient.find(params[:id])
    @doctor = @appointment.doctor.find(params[:doctor_id])
---
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1

  def create

    @appointment = @doctor.appointments.new(appointment_params)

    @appointments_q = Appointment.all.where(doctor_id: @doctor.id, date: @appointment.date, time: @appointment.time)


    if @appointments_q.empty?
      if @appointment.date <= DateTime.now
      flash.now[:notice] = "Date Selected is Invalid! You can select any date starting from tomorrow"
      render :new
      else
      @appointment.save
---
SELECT `appointments`.* FROM `appointments` WHERE (doctor_id = 7 AND patient_id = 1 )
SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`doctor_id` = 7 AND `appointments`.`id` = 13 LIMIT 1
SELECT  1 AS one FROM `appointments` WHERE `appointments`.`doctor_id` = 7 AND `appointments`.`date` = '2020-10-11' AND `appointments`.`time` = '09:00:00' LIMIT 1
INSERT INTO `appointments` (`patient_id`, `doctor_id`, `created_at`, `updated_at`, `date`, `time`) VALUES (1, 7, '2020-10-11 10:36:07', '2020-10-11 10:36:07', '2020-10-12', '09:30:00')

  def destroy
    @doctor.appointments.find(params[:id]).destroy
---
DELETE FROM `appointments` WHERE `appointments`.`id` = 34
SELECT  `appointments`.* FROM `appointments` WHERE `appointments`.`doctor_id` = 7 AND `appointments`.`id` = 34 LIMIT 1

    def set_doctor
      @doctor = Doctor.find(params[:doctor_id])
---
SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 7 LIMIT 1

    def set_patients
      @patients = (Patient.all.order("last_name") - @doctor.patients)
---
SELECT `patients`.* FROM `patients` ORDER BY last_name