app/controllers/availabilities_controller.rb

SELECT `availabilities`.* FROM `availabilities`
---
  def index
    @availabilities = Availability.all

SELECT `availabilities`.* FROM `availabilities` LEFT OUTER JOIN `doctors` ON `doctors`.`id` = `availabilities`.`doctor_id` WHERE (doctor_id)
---
  def show
    @id = params[:id]
    @availabilities = Availability.joins(:doctor).where("doctor_id", params[:id])

SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 5 LIMIT 1
---
  def new
    @availability = Availability.new
    @doc_details = Doctor.where("users_id = #{current_user.id}")

INSERT INTO `availabilities` (`start_time`, `end_time`, `doctor_id`, `created_at`, `updated_at`) VALUES ('09:42:00', '09:30:00', 6, '2020-10-10 19:42:52', '2020-10-10 19:42:52')
---
  def create
    @availability = Availability.new(availability_params)

    respond_to do |format|
      if @availability.save

SELECT  `availabilities`.* FROM `availabilities` WHERE `availabilities`.`id` = 6 LIMIT 1
---
    def set_availability
      @availability = Availability.find(params[:doctor_id])