app/controllers/doctors_controller.rb

SELECT `doctors`.* FROM `doctors` INNER JOIN `users` ON `users`.`id` = `doctors`.`users_id` WHERE (doctors.users_id = 5)
---
  def index
    if current_user.role == 'doctor'
    @doc_info = Doctor.joins(:user).where("doctors.users_id = ?", current_user)
    else
    @doc_info = Doctor.joins(:user)

INSERT INTO `doctors` (`name`, `created_at`, `updated_at`, `specialty`, `phone`, `encrypted_password`) VALUES ('dxgs', '2020-10-10 13:56:10', '2020-10-10 13:56:10', 'Allergy & Immunology', '242', '1234')
---
  def create
    @doctor = Doctor.new(doctor_params)
    if @doctor.save

DELETE FROM `doctors` WHERE `doctors`.`id` = 2
---
  def destroy
    @doctor.destroy

SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 0 LIMIT 1
---
    def set_doctor
      @doctor = Doctor.find(params[:id])