app/controllers/patients_controller.rb

SELECT `patients`.* FROM `patients` ORDER BY last_name
---
  def index
    @patients = Patient.all.order("last_name")

SELECT `appointments`.* FROM `appointments` WHERE `appointments`.`patient_id` = 1 ORDER BY date, time
---
  def show
    @appointments = @patient.appointments.order("date", "time")

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 5 LIMIT 1
---
    def set_patient
      @patient = Patient.find(params[:id])