app/views/appointments/new.html.erb

    <%= f.label :doctor_availability %>
    <%= f.select :time, options_for_select(Availability.all.map{|s|[s.start_time.strftime("%I:%M").concat("-").concat(s.end_time.strftime("%I:%M")), s.start_time] if s.doctor_id==@doctor.id}.compact,{ include_blank: false, include_hidden: false }) %>
---
SELECT `doctors`.* FROM `doctors`
SELECT `availabilities`.* FROM `availabilities`