app/views/availabilities/_form.html.erb

SELECT `doctors`.* FROM `doctors`
---
    <%= form.label :doctor_id %>
    <%= form.select :doctor_id, options_for_select(Doctor.all.map{|s|[s.name, s.id] if s.users_id==current_user.id}.compact,{ include_blank: false, include_hidden: false }) %>